{
  "sobre": "About CBSoft",
  "descricao": [
    {
      "tipo": "markdown",
      "conteudo": [
        "The **Brazilian Conference on Software: Practice and Theory (CBSoft)** is an event annually promoted by the Brazilian Computing Society (SBC) aiming at fostering the exchange of experience among researchers and practitioners from industry and academia about the most recent research, tendencies, and theoretical and practical innovations on software. Held since 2010 as an aggregating conference of Brazilian symposia promoted by SBC on software, CBSoft has become one of the main conferences of the Brazilian scientific community on Computing.",
        "In { ano }, the { edicao } edition of CBSoft will be held **in person**, from **{ dataEvento } in { localEvento }**. It will integrate four traditional symposia annualy promoted by the Brazilian community on Software Engineering:"
      ]
    },
    {
      "tipo": "ul",
      "itens": [
        [
          {
            "tipo": "link",
            "href": "../sbes",
            "label": "{ edicoesSbes } { siglasSbes }"
          },
          ", the premier conference on Software Engineering in Latin America;"
        ],
        [
          {
            "tipo": "link",
            "href": "../sblp",
            "label": "{ edicoesSblp } { siglasSblp }"
          },
          ", which focuses on the theoretical and practical study of programming languages;"
        ],
        [
          {
            "tipo": "link",
            "href": "../sbcars",
            "label": "{ edicoesSbcars } { siglasSbcars }"
          },
          ", which aggregates topics such as software product lines, component-based software development, software architectures, and reuse;  and"
        ],
        [
          {
            "tipo": "link",
            "href": "../sast",
            "label": "{ edicoesSast } { siglasSast }"
          },
          ", which is about issues related to the systematization and automation of the software testing activity."
        ]
      ]
    },
    "The CBSoft programme will include technical sessions with presentation of scientific papers, keynotes by nationally and internationally renowned Brazilian and foreign researchers, discussion panels, workshops, and tool demonstrations. All these activites of interest of the Software Engineering community and fields related to the development of software systems go towards the diffusion of knowledge and discussion of important issues related to research, development, and innovation in both Brazil and the world."
  ]
}
