[
  {
    "category": "full",
    "track": "pesquisa",
    "schedule": {
      "session": 0,
      "start": "11:00:00-03:00",
      "end": "11:14:00-03:00"
    },
    "title": "An empirical evaluation of fuzz targets using mutation testing",
    "authors": "Bruno Ely Reis Garcia (USP), Simone do Rocio Senger Souza (USP)"
  },
  {
    "category": "full",
    "track": "pesquisa",
    "schedule": {
      "session": 0,
      "start": "11:15:00-03:00",
      "end": "11:28:00-03:00"
    },
    "title": "Ensuring Test Case Coverage through Multilabel Requirements Classification",
    "authors": "Flavia Camila Morais de Oliveira (Sidia Instituto de Ciência e Tecnologia), Ana Paula Silva (Sidia Instituto de Ciência e Tecnologia), Leonardo Tiago (Sidia Instituto de Ciência e Tecnologia), Lennon Chaves (UFAM)"
  },
  {
    "category": "full",
    "track": "pesquisa",
    "schedule": {
      "session": 0,
      "start": "11:29:00-03:00",
      "end": "11:42:00-03:00"
    },
    "title": "Career Mapping in Software Testing: insights into the professional profile",
    "authors": "José Wilton R. A. Filho, Francisco Adam Andrade, Jarbele Coutinho (UFERSA), Wilkerson L. Andrade (UFCG)"
  },
  {
    "category": "full",
    "track": "pesquisa",
    "schedule": {
      "session": 0,
      "start": "11:43:00-03:00",
      "end": "11:56:00-03:00"
    },
    "title": "An Empirical Study on the Co-occurrence of Test Smells",
    "authors": "Railana Santana (UFBA), Luana Martins, Marcio Ribeiro (UFAL), Ivan C Machado (UFBA)"
  },
  {
    "category": "full",
    "track": "pesquisa",
    "schedule": {
      "session": 0,
      "start": "11:57:00-03:00",
      "end": "12:10:00-03:00"
    },
    "title": "On the prevalence of test smells in mobile development",
    "authors": "Tassio Guerreiro Antunes Virginio (UFBA), Marcio Ribeiro (UFAL), Ivan do Carmo Machado (UFBA)"
  },
  {
    "category": "abstract",
    "track": "industry",
    "schedule": {
      "session": 0,
      "start": "12:11:00-03:00",
      "end": "12:17:00-03:00"
    },
    "title": "From Chaos to Automation: A Journey of Functional Test Evolution in the Public Sector",
    "authors": "Bruno Pedraça de Souza (COPPE/UFRJ), Rebeca Campos Motta, Jessica Soares da Costa, Elaine Nunes (COPPE/UFRJ), Gustavo Rocha Barreto Pinto, Rafael Maiani de Mello (UFRJ)"
  },
  {
    "category": "abstract",
    "track": "industry",
    "schedule": {
      "session": 0,
      "start": "12:18:00-03:00",
      "end": "12:24:00-03:00"
    },
    "title": "Testing REST APIs on National Irrigation Information System",
    "authors": "João Victor de Morais, Neumar Malheiros (UFLA), Ricardo Terra (UFLA)"
  },
  {
    "category": "abstract",
    "track": "industry",
    "schedule": {
      "session": 0,
      "start": "12:24:00-03:00",
      "end": "12:31:00-03:00"
    },
    "title": "Simulating Non-Functional Communication Requirements in Automotive Software",
    "authors": "Larissa Pestana (Stellantis), Breno Miranda (UFPE)"
  },
  {
    "category": "full",
    "track": "pesquisa",
    "schedule": {
      "session": 0,
      "start": "14:00:00-03:00",
      "end": "14:14:00-03:00"
    },
    "title": "Evaluating the Effectiveness of LLMs in Multimodal GUI Test Generation for Android Mobile Applications",
    "authors": "Nayse Fagundes (UFPE), Leopoldo Motta Teixeira (UFPE)"
  },
  {
    "category": "full",
    "track": "pesquisa",
    "schedule": {
      "session": 0,
      "start": "14:15:00-03:00",
      "end": "14:28:00-03:00"
    },
    "title": "Generating Exploratory Test Suites with ChatGPT: Insights from an Empirical Study",
    "authors": "Natália Salvino André, Everton L.G. Alves (UFCG)"
  },
  {
    "category": "full",
    "track": "pesquisa",
    "schedule": {
      "session": 0,
      "start": "14:29:00-03:00",
      "end": "14:42:00-03:00"
    },
    "title": "Image2Test: Using ChatGPT to Build Manual Tests from Screenshots",
    "authors": "Manoel Aranda III (UFAL), Antônio Wagner (UFAL), Eduardo Barros (UFAL), Marcio Ribeiro (UFAL), Alessandro Garcia (PUC-Rio), Baldoino Fonseca (UFAL), Ivan do Carmo Machado (UFBA), Fabio Palomba (University of Salerno)"
  },
  {
    "category": "full",
    "track": "pesquisa",
    "schedule": {
      "session": 0,
      "start": "14:43:00-03:00",
      "end": "14:56:00-03:00"
    },
    "title": "On the Energy Footprint of Using a Small Language Model for Unit Test Generation",
    "authors": "Rafael Serapilha Durelli (UFLA), Andre Takeshi Endo (UFSCAR), Vinicius Durelli (UFSCAR)"
  },
  {
    "category": "full",
    "track": "pesquisa",
    "schedule": {
      "session": 0,
      "start": "14:57:00-03:00",
      "end": "15:10:00-03:00"
    },
    "title": "Semantic Conflict Detection Using LLM-Generated Unit Tests",
    "authors": "Nathalia Barbosa (CIn/UFPE), Paulo Borba (UFPE), Leuson Da Silva (Polytechnique Montreal)"
  },
  {
    "category": "abstract",
    "track": "industry",
    "schedule": {
      "session": 0,
      "start": "15:11:00-03:00",
      "end": "15:17:00-03:00"
    },
    "title": "Improving Bug Reporting by Fine-Tuning the T5 Model: An Evaluation in a Software Industry",
    "authors": "Davi Menezes (Sidia), Leonardo Tiago (Sidia), Flavia Camila Morais de Oliveira (Sidia), Ana Paula Silva (Sidia), Lennon Chaves (UFAM)"
  },
  {
    "category": "abstract",
    "track": "industry",
    "schedule": {
      "session": 0,
      "start": "15:18:00-03:00",
      "end": "15:24:00-03:00"
    },
    "title": "The Influence of Using LLMs on the Activities of a Software Testing Team: An Industry Case",
    "authors": "Flavia Camila Morais de Oliveira (Sidia), Leonardo Tiago (Sidia), Lennon Chaves (UFAM)"
  },
  {
    "category": "abstract",
    "track": "industry",
    "schedule": {
      "session": 0,
      "start": "15:24:00-03:00",
      "end": "15:31:00-03:00"
    },
    "title": "Validation of Image Content Using LLMs and RAGs: A Strategy for Ensuring Compliance in Software Testing",
    "authors": "Wendell Marques (Samsung SIDIA), Cainã Oliveira, Carol Fernandes, Luiz Ribeiro, Edluce Leitão Veras, Gabriel Sampaio, Kauã Sanches, Renan Peres (Sidia)"
  },
  {
    "category": "full",
    "track": "pesquisa",
    "schedule": {
      "session": 0,
      "start": "16:00:00-03:00",
      "end": "16:14:00-03:00"
    },
    "title": "DroidOrchestrator: Container-Based Framework for Automation of Customized Android Security Testing Environment Generation",
    "authors": "Dario Fernandes Filho (UFPR), Christian Debovi Paim de Oliveira, Cláudio Torres Junior (UFPR), André R. A. Grégio (UFPR)"
  },
  {
    "category": "full",
    "track": "pesquisa",
    "schedule": {
      "session": 0,
      "start": "16:15:00-03:00",
      "end": "16:28:00-03:00"
    },
    "title": "On the Implementation of OS-Specific Tests: The CPython Case",
    "authors": "Ricardo de Sousa Job (IFPB), André C. Hora (UFMG)"
  },
  {
    "category": "full",
    "track": "pesquisa",
    "schedule": {
      "session": 0,
      "start": "16:29:00-03:00",
      "end": "16:42:00-03:00"
    },
    "title": "RAVEN: Enhancing Test Request Reliability through Real-Time Verification in High-Complexity Systems",
    "authors": "Rayfran Rocha Lima (Sidia), Rodrigo Carvalho Silva"
  },
  {
    "category": "full",
    "track": "pesquisa",
    "schedule": {
      "session": 0,
      "start": "16:43:00-03:00",
      "end": "16:56:00-03:00"
    },
    "title": "Real-Time Feedback for BDD Test Scenarios Using AI-Based Classification",
    "authors": "David Brandao (POLI), Denis Marques (UPE), Cleyton Mário de Oliveira Rodrigues (UPE), Wylliams Barbosa Santos (UPE)"
  },
  {
    "category": "full",
    "track": "pesquisa",
    "schedule": {
      "session": 0,
      "start": "16:57:00-03:00",
      "end": "17:10:00-03:00"
    },
    "title": "Resilience Testing of Celery: An Experimental Approach Using Fault Injection",
    "authors": "Pedro Lima, Breno Miranda (UFPE)"
  },
  {
    "category": "abstract",
    "track": "industry",
    "schedule": {
      "session": 0,
      "start": "17:11:00-03:00",
      "end": "17:17:00-03:00"
    },
    "title": "Application of Computer Vision to image review process in the software development",
    "authors": "Wendell Marques (Samsung SIDIA), Andrezza Bonfim (Sidia), Eduardo Peluchi de Oliveira Filho (Sidia), Edluce Leitão Veras (Sidia), Daniel Augusto Rodrigues Lima de Souza (Sidia), Vinicius Silva (Sidia)"
  },
  {
    "category": "abstract",
    "track": "industry",
    "schedule": {
      "session": 0,
      "start": "17:18:00-03:00",
      "end": "17:24:00-03:00"
    },
    "title": "Deploying a Low-Cost Vision-Guided Cartesian Robot for Physical Interaction in Mobile Testing",
    "authors": "Matheus Lopes (UFPE), Breno Miranda (UFPE)"
  }
]
