{
  "sobre": "Sobre o CBSoft",
  "descricao": [
    {
      "tipo": "markdown",
      "conteudo": [
        "O **Congresso Brasileiro de Software: Teoria e Prática (CBSoft)** é um evento realizado anualmente pela Sociedade Brasileira de Computação (SBC) com o objetivo de promover e incentivar a troca de experiências entre pesquisadores e profissionais da indústria e academia sobre as mais recentes pesquisas, tendências e inovações práticas e teóricas sobre software. Realizado desde 2010 como evento agregador de simpósios brasileiros promovidos pela SBC na área de software, o CBSoft tornou-se um dos principais eventos da comunidade científica brasileira na área de Computação.",
        "Em { ano }, a { edicao } edição do CBSoft será realizada **presencialmente**, de **{ dataEvento } em { localEvento },** integrando quatro eventos tradicionais realizados anualmente pela comunidade brasileira em Engenharia de Software:"
      ]
    },
    {
      "tipo": "ul",
      "itens": [
        [
          {
            "tipo": "link",
            "href": "../sbes",
            "label": "{ edicoesSbes } { siglasSbes }"
          },
          ", o principal evento de Engenharia de Software na América Latina;"
        ],
        [
          {
            "tipo": "link",
            "href": "../sblp",
            "label": "{ edicoesSblp } { siglasSblp }"
          },
          ", que possui enfoque no estudo teórico e prático de linguagens de programação;"
        ],
        [
          {
            "tipo": "link",
            "href": "../sbcars",
            "label": "{ edicoesSbcars } { siglasSbcars }"
          },
          ", que agrega tópicos como linhas de produto de software, desenvolvimento de software baseado em componentes, arquiteturas de software e reutilização; e"
        ],
        [
          {
            "tipo": "link",
            "href": "../sast",
            "label": "{ edicoesSast } { siglasSast }"
          },
          ", que versa sobre questões relacionadas à sistematização e automação da atividade de teste de software."
        ]
      ]
    },
    "A programação do CBSoft incluirá sessões técnicas com apresentações de artigos científicos, palestras proferidas por pesquisadores brasileiros e estrangeiros de renome nacional e internacional, painéis de discussão, workshops, e demonstrações de ferramentas. Todas essas diversas atividades de interesse da comunidade de Engenharia de Software e de áreas relacionadas ao desenvolvimento de sistemas de software direcionam-se para a difusão do conhecimento e discussão de questões importantes relacionadas à pesquisa, desenvolvimento e inovação, tanto no Brasil quanto no mundo."
  ],
  "data": {
    "descricao": "Data do evento",
    "periodo": "{ dataEvento }"
  },
  "local": {
    "descricao": "Local do evento",
    "local": "Mar Hotel",
    "detalhes": "Recife, Pernambuco"
  },
  "sponsors": {
    "realizacao": "Realização",
    "organizadores": "Organização",
    "apoio": "Apoio",
    "patrocinio": "Patrocínio"
  }
}
